lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void update_demo_channels_from_create_config(void) {
  uint8_t channel_map[10];
  uint8_t channels[4];
  uint8_t found = 0U;
  uint8_t last = 2U;
  uint32_t packed = 0U;
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  bytes_copy(channel_map, (const void *)&g_host_transport->hostData[17], sizeof(channel_map));
  for (uint8_t bit = 0U; bit < 80U && found < 4U; ++bit) {
    if (channel_map_bit_enabled(channel_map, bit)) {
      last = bit;
      channels[found++] = bit;
    }
  }
  if (found == 0U) {
    return;
  }
  for (uint8_t i = found; i < 4U; ++i) {
    channels[i] = last;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    packed |= ((uint32_t)channels[i] << (8U * i));
  }
  g_cs_demo_channels_packed = packed;
}
#endif

static size_t build_remote_caps_payload(uint8_t *payload, size_t max_len, uint16_t conn_handle) {
  if (payload == NULL || max_len < 34U) {
    return 0U;
  }
  bytes_zero(payload, 34U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = 4U;
  write_le16(&payload[4], 6U);
  payload[6] = 4U;
  payload[7] = 4U;
  payload[8] = 0x03U;
  payload[9] = 0x01U;
  payload[10] = 0x07U;
  payload[11] = 0x02U;
  payload[12] = 0x03U;
  payload[13] = 0x04U;
  write_le16(&payload[14], 0x0001U);
  write_le16(&payload[16], 0x0001U);
  payload[18] = 0x06U;
  write_le16(&payload[19], 0x001EU);
  write_le16(&payload[21], 10U);
  write_le16(&payload[23], 20U);
  write_le16(&payload[25], 30U);
  write_le16(&payload[27], 40U);
  payload[29] = 3U;
  payload[30] = 4U;
  write_le16(&payload[31], 50U);
  payload[33] = 6U;
  return 34U;
}

static size_t build_security_complete_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 3U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  return 3U;
}

static size_t build_config_complete_payload(uint8_t *payload, size_t max_len,
                                            uint16_t conn_handle) {
  static const uint8_t channel_map[10] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                                          0x00U, 0x00U, 0x00U, 0x00U, 0x00U};
  if (payload == NULL || max_len < 33U) {
    return 0U;
  }
  bytes_zero(payload, 33U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[3] = g_cs_config_id;
#else
  payload[3] = 1U;
#endif
  payload[4] = 1U;
  payload[5] = BLE_CS_MAIN_MODE2;
  payload[6] = 0xFFU;
  payload[7] = 3U;
  payload[8] = 5U;
  payload[9] = 1U;
  payload[10] = 1U;
  payload[11] = 0U;
  payload[12] = 1U;
  payload[13] = 2U;
  bytes_copy(&payload[14], channel_map, sizeof(channel_map));
  payload[24] = 1U;
  payload[25] = 1U;
  payload[26] = 1U;
  payload[27] = 3U;
  payload[28] = 0x01U;
  payload[29] = 10U;
  payload[30] = 20U;
  payload[31] = 30U;
  payload[32] = 40U;
  return 33U;
}

static size_t build_procedure_enable_complete_payload(uint8_t *payload, size_t max_len,
                                                      uint16_t conn_handle) {
  if (payload == NULL || max_len < 21U) {
    return 0U;
  }
  bytes_zero(payload, 21U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[3] = g_cs_config_id;
#else
  payload[3] = 1U;
#endif
  payload[4] = 1U;
  payload[5] = 2U;
  payload[6] = (uint8_t)(int8_t)-12;
  write_le24(&payload[7], 0x000456UL);
  payload[10] = 4U;
  write_le16(&payload[11], 100U);
  write_le16(&payload[13], 200U);
  write_le16(&payload[15], 300U);
  write_le16(&payload[17], 8U);
  write_le16(&payload[19], 12U);
  return 21U;
}

static size_t build_subevent_initial_payload(uint8_t *payload, size_t max_len,
                                             uint16_t conn_handle) {
  const uint32_t channels =
#if VPR_CS_DEDICATED_IMAGE
      current_demo_channels_packed();
#else
      g_host_transport->reserved;
#endif
  if (payload == NULL || max_len < 31U) {
    return 0U;
  }
  bytes_zero(payload, 31U);
  write_le16(&payload[0], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[2] = g_cs_config_id;
#else
  payload[2] = 1U;
#endif
  write_le16(&payload[3], 0x1234U);
#if VPR_CS_DEDICATED_IMAGE
  write_le16(&payload[5], g_cs_procedure_counter);
#else
  write_le16(&payload[5], 7U);
#endif
  write_le16(&payload[7], 0U);
  payload[9] = 0U;
  payload[10] = 0x01U;
  payload[11] = 0x01U;
  payload[12] = 0U;
  payload[13] = 2U;
  payload[14] = 2U;
  append_mode2_demo_step(&payload[15], (uint8_t)(channels & 0xFFU));
  append_mode2_demo_step(&payload[23], (uint8_t)((channels >> 8U) & 0xFFU));
  return 31U;
}

static size_t build_subevent_continue_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  const uint32_t channels =
#if VPR_CS_DEDICATED_IMAGE
      current_demo_channels_packed();
#else
      g_host_transport->reserved;
#endif
  if (payload == NULL || max_len < 24U) {
    return 0U;
  }
  bytes_zero(payload, 24U);
  write_le16(&payload[0], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[2] = g_cs_config_id;
#else
  payload[2] = 1U;
#endif
  payload[3] = 0U;
  payload[4] = 0U;
  payload[5] = 0U;
  payload[6] = 2U;
  payload[7] = 2U;
  append_mode2_demo_step(&payload[8], (uint8_t)((channels >> 16U) & 0xFFU));
  append_mode2_demo_step(&payload[16], (uint8_t)((channels >> 24U) & 0xFFU));
  return 24U;
}

#if VPR_CS_DEDICATED_IMAGE
static size_t build_peer_subevent_initial_payload(uint8_t *payload, size_t max_len,
                                                  uint16_t conn_handle) {
  const uint32_t channels = current_demo_channels_packed();
  if (payload == NULL || max_len < 31U) {
    return 0U;
  }
  bytes_zero(payload, 31U);
  write_le16(&payload[0], conn_handle);
  payload[2] = g_cs_config_id;
  write_le16(&payload[3], 0x1234U);
  write_le16(&payload[5], g_cs_procedure_counter);
  write_le16(&payload[7], 0U);
  payload[9] = 0U;
  payload[10] = 0x01U;
  payload[11] = 0x01U;
  payload[12] = 0U;
  payload[13] = 2U;
  payload[14] = 2U;
  append_mode2_peer_demo_step(&payload[15], (uint8_t)(channels & 0xFFU));
  append_mode2_peer_demo_step(&payload[23], (uint8_t)((channels >> 8U) & 0xFFU));
  return 31U;
}

